## Global Student Diversity Insights

**The hypothesis suggests a slow increase in the number of females in academic programs over the last decade. To support this idea, we'll take a close look at how many boys and girls were enrolled in different academic years using the Global_Student_Diversity_Insights database. This analysis aims to reveal noticeable patterns and differences in gender participation over specific time periods, providing useful insights into the complex dynamics of gender representation in education. The potential impact of this study goes beyond mere observation; it could help shape educational policies to create more inclusive and diverse academic environments worldwide.**

**Step 1: Import the database into VSCode and explore insights within the Global_Student_Diversity_Insights database.**

In [2]:
import os 

import numpy as np

import pandas as pd

import pymysql as mysql

import opendatasets as od

import matplotlib.pyplot as plt

from sqlalchemy import create_engine

from sqlalchemy.orm import sessionmaker

from sqlalchemy import text

from zipfile import ZipFile

In [3]:
# Set your Kaggle API key and username
os.environ['KAGGLE_USERNAME'] = "mirnaphilip"
os.environ['KAGGLE_KEY'] = "4576ed829c0e6ffdc6c0d9278ad9d5f4"

# Correct Kaggle dataset URL
kaggle_url = "https://www.kaggle.com/webdevbadger/international-student-demographics/data"

# Use opendatasets.download function
od.download(kaggle_url, download_path='/Users/mirnaphilip/Desktop/Practical_data_engneering/project/Global-Student-Diversity-Insights', force=True)

Please provide your Kaggle credentials to download this dataset. Learn more: http://bit.ly/kaggle-creds
Your Kaggle username:Your Kaggle Key:Downloading international-student-demographics.zip to ./international-student-demographics

100%|██████████| 139k/139k [00:00<00:00, 1.78MB/s]

In [4]:
 # CSV files are in the following directory
dataset_path = "/Users/mirnaphilip/Desktop/Practical_data_engneering/project/Global-Student-Diversity-Insights/international-student-demographics"

# Load a CSV file into a DataFrame
academic_df = pd.read_csv(os.path.join(dataset_path, "academic.csv"))
field_of_study_df = pd.read_csv(os.path.join(dataset_path, "field_of_study.csv"))
source_of_fund_df = pd.read_csv(os.path.join(dataset_path, "source_of_fund.csv"))
academic_detail_df = pd.read_csv(os.path.join(dataset_path, "academic_detail.csv"))
origin_df = pd.read_csv(os.path.join(dataset_path, "origin.csv"))
status_df = pd.read_csv(os.path.join(dataset_path, "status.csv"))

In [5]:
# MySQL connection parameters
mysql_username = 'root'
mysql_password = '123123123'
mysql_host = 'localhost'
mysql_port = 3306
mysql_database = 'Global_Student_Diversity_Insights'

# Creating a connection to the MySQL database
engine = create_engine(f"mysql+pymysql://{mysql_username}:{mysql_password}@{mysql_host}:{mysql_port}/{mysql_database}")

In [6]:
# Load CSV files into DataFrames
csv_files = [
    'academic.csv', 'field_of_study.csv', 'source_of_fund.csv',
    'academic_detail.csv', 'origin.csv', 'status.csv'
]

for csv_file in csv_files:
    # Load CSV into DataFrame
    df = pd.read_csv(os.path.join(dataset_path, csv_file))

    # Write DataFrame to MySQL database
    table_name = csv_file.split('.')[0]
    df.to_sql(table_name, engine, index=False, if_exists='replace')

print("Data successfully loaded into MySQL database.")

Data successfully loaded into MySQL database.

In [7]:
showTable = pd.read_sql("Show Tables ", engine)
showTable

  Tables_in_global_student_diversity_insights
0                                    academic
1                             academic_detail
2                              field_of_study
3                                      origin
4                              source_of_fund
5                                      status

###### The "Global_Student_Diversity_Insights" dataset consists of six tables—academic details, enrollment, field of study, student origin, funding sources, and student status—offering comprehensive insights into various aspects of global student diversity.

In [8]:
academicDetailDisplay = pd.read_sql("SELECT * FROM academic_detail;", engine)
print("Display of the table:")
academicDetailDisplay.head(3)

Display of the table:

      year  academic_type academic_level  students
0  1999/00  Undergraduate    Associate's     59830
1  1999/00  Undergraduate     Bachelor's    177381
2  1999/00       Graduate       Master's    110857

In [9]:
academicDisplay = pd.read_sql("SELECT * FROM academic;", engine)
print("Display of the table:")
academicDisplay.head(3)

Display of the table:

      year  students  us_students  undergraduate  graduate  non_degree  opt
0  1948/49     25464    2403400.0            NaN       NaN         NaN  NaN
1  1949/50     26433    2445000.0            NaN       NaN         NaN  NaN
2  1950/51     29813    2281000.0            NaN       NaN         NaN  NaN

In [10]:
studyFieldDisplay = pd.read_sql("SELECT * FROM field_of_study;", engine)
print("Display of the table:")
studyFieldDisplay.head(3)

Display of the table:

,year,field_of_study,major,students
0,1998/99,Agriculture,Agriculture,6146.0
1,1998/99,Agriculture,Natural Resources and Conservation,1803.0
2,1998/99,Business and Management,Business and Management,101360.0

In [11]:
originDisplay = pd.read_sql("SELECT * FROM origin;", engine)
print("Display of the table:")
originDisplay.head(3)

Display of the table:

,year,origin_region,origin,academic_type,students
0,2000/01,"Africa, Subsaharan","Africa, Subsaharan, Unspecified",Graduate,2
1,2000/01,"Africa, Subsaharan","Africa, Subsaharan, Unspecified",Other,0
2,2000/01,"Africa, Subsaharan","Africa, Subsaharan, Unspecified",Undergraduate,6

In [12]:
sourceOfFundDisplay = pd.read_sql("SELECT * FROM source_of_fund;", engine)
print("Display of the table:")
sourceOfFundDisplay.head(3)

Display of the table:

,year,academic_type,source_type,source_of_fund,students
0,1999/00,Undergraduate,International,Personal and Family,201578
1,1999/00,Undergraduate,International,Foreign Government or University,9742
2,1999/00,Undergraduate,International,Foreign Private Sponsor,6245

In [13]:
statusDisplay = pd.read_sql("SELECT * FROM status;", engine)
print("Display of the table:")
statusDisplay.head(3)

Display of the table:

,year,female,male,single,married,full_time,part_time,visa_f,visa_j,visa_other
0,2007/08,278841.0,344964.0,543958.0,79847.0,575772.0,48033.0,552691.0,31814.0,39300.0
1,2008/09,304242.0,367374.0,591694.0,79922.0,613185.0,58431.0,589007.0,39625.0,42984.0
2,2009/10,309534.0,381389.0,615612.0,75311.0,637722.0,53201.0,612158.0,38692.0,40073.0

**Step 2 Basic Overview:**

In [14]:
academicDetail = pd.read_sql("""DESCRIBE academic_detail;
""", engine)
print("The decribe table of academic detail modified:")
academicDetail

The decribe table of academic detail modified:

            Field    Type Null Key Default Extra
0            year    text  YES        None
1   academic_type    text  YES        None
2  academic_level    text  YES        None
3        students  bigint  YES        None

In [15]:
academic = pd.read_sql("""DESCRIBE academic;
""", engine)
print("The decribe table of academic modified:")
academic

The decribe table of academic modified:

           Field    Type Null Key Default Extra
0           year    text  YES        None
1       students  bigint  YES        None
2    us_students  double  YES        None
3  undergraduate  double  YES        None
4       graduate  double  YES        None
5     non_degree  double  YES        None
6            opt  double  YES        None

In [16]:
studyField= pd.read_sql("""DESCRIBE field_of_study;
""", engine)
print("The decribe table of field of study modified:")
studyField

The decribe table of field of study modified:

            Field    Type Null Key Default Extra
0            year    text  YES        None
1  field_of_study    text  YES        None
2           major    text  YES        None
3        students  double  YES        None

In [17]:
origin= pd.read_sql("""DESCRIBE origin;
""", engine)
print("The decribe table of origin modified:")
origin

The decribe table of origin modified:

           Field    Type Null Key Default Extra
0           year    text  YES        None
1  origin_region    text  YES        None
2         origin    text  YES        None
3  academic_type    text  YES        None
4       students  bigint  YES        None

In [18]:
sourceOfFund = pd.read_sql("""DESCRIBE source_of_fund;
""", engine)
print("The decribe table of source of fund modified:")
sourceOfFund

The decribe table of source of fund modified:

            Field    Type Null Key Default Extra
0            year    text  YES        None
1   academic_type    text  YES        None
2     source_type    text  YES        None
3  source_of_fund    text  YES        None
4        students  bigint  YES        None

In [19]:
# Load each table into a DataFrame for EDA
tables = ['status', 'academic', 'field_of_study', 'origin', 'source_of_fund', 'academic_detail']
for i in tables:
     # Load table into DataFrame
    dfDESCRIBE = pd.read_sql_query(f"DESCRIBE {i}", engine)
    # Display table name
    print(f"\n{i} - Basic Overview:")
    # Display Basic Overview:
    print(dfDESCRIBE)
# Close the engine connection
engine.dispose()

status - Basic Overview:
        Field    Type Null Key Default Extra
0        year    text  YES        None
1      female  double  YES        None
2        male  double  YES        None
3      single  double  YES        None
4     married  double  YES        None
5   full_time  double  YES        None
6   part_time  double  YES        None
7      visa_f  double  YES        None
8      visa_j  double  YES        None
9  visa_other  double  YES        None

academic - Basic Overview:
           Field    Type Null Key Default Extra
0           year    text  YES        None
1       students  bigint  YES        None
2    us_students  double  YES        None
3  undergraduate  double  YES        None
4       graduate  double  YES        None
5     non_degree  double  YES        None
6            opt  double  YES        None

field_of_study - Basic Overview:
            Field    Type Null Key Default Extra
0            year    text  YES        None
1  field_of_study    text  YES        None
2           major    text  YES        None
3        students  double  YES        None

origin - Basic Overview:
           Field    Type Null Key Default Extra
0           year    text  YES        None
1  origin_region    text  YES        None
2         origin    text  YES        None
3  academic_type    text  YES        None
4       students  bigint  YES        None

source_of_fund - Basic Overview:
            Field    Type Null Key Default Extra
0            year    text  YES        None
1   academic_type    text  YES        None
2     source_type    text  YES        None
3  source_of_fund    text  YES        None
4        students  bigint  YES        None

academic_detail - Basic Overview:
            Field    Type Null Key Default Extra
0            year    text  YES        None
1   academic_type    text  YES        None
2  academic_level    text  YES        None
3        students  bigint  YES        None

**Step 3 Summary Statistics**

In [20]:
# Load each table into a DataFrame for EDA
tables = ['status', 'academic', 'field_of_study', 'origin', 'source_of_fund', 'academic_detail']
for i in tables:
     # Load table into DataFrame
    df = pd.read_sql_query(f"SELECT * FROM {i}", engine)
    # Display table name
    print(f"\n{i} - Summary Statistics:")
    # Display summary statistics
    print(df.describe())
# Close the engine connection
engine.dispose()

status - Summary Statistics:
              female           male        single        married  \
count      16.000000      16.000000  1.600000e+01      16.000000
mean   400165.875000  503758.375000  8.186190e+05   85305.250000
std     71337.004816   96374.058647  1.594363e+05    9826.503247
min    278841.000000  344964.000000  5.439580e+05   69435.000000
25%    334648.750000  419541.750000  6.812148e+05   78660.500000
50%    416864.500000  513098.500000  8.442555e+05   87051.500000
75%    471179.500000  593386.750000  9.674375e+05   91414.000000
max    480836.000000  617463.000000  1.002199e+06  107882.000000

          full_time     part_time        visa_f        visa_j    visa_other
count  1.600000e+01     16.000000  1.600000e+01     16.000000     16.000000
mean   8.431138e+05  60810.500000  8.276002e+05  40853.562500  35470.500000
std    1.610567e+05   8188.518653  1.669807e+05   9937.639606   3733.618924
min    5.757720e+05  48033.000000  5.526910e+05  16454.000000  29508.000000
25%    7.027862e+05  53984.750000  6.778982e+05  37740.750000  32554.250000
50%    8.638650e+05  60773.500000  8.707480e+05  42334.000000  34772.000000
75%    9.916720e+05  67682.750000  9.908145e+05  45008.000000  37916.750000
max    1.030676e+06  72025.000000  1.018628e+06  58496.000000  42984.000000

academic - Summary Statistics:
           students   us_students  undergraduate       graduate    non_degree  \
count  7.500000e+01  7.200000e+01      49.000000      49.000000     44.000000
mean   3.961118e+05  1.232750e+07  243060.224490  224228.204082  38366.909091
std    3.246805e+05  6.008504e+06  103238.712533  109538.265949  20995.604738
min    2.546400e+04  2.102000e+06   19101.000000   12118.000000  16850.000000
25%    1.052885e+05  7.882000e+06  189900.000000  146100.000000  21900.000000
50%    3.437770e+05  1.263550e+07  235802.000000  211426.000000  30581.000000
75%    5.777465e+05  1.732575e+07  291439.000000  296574.000000  52559.750000
max    1.095299e+06  2.125300e+07  442746.000000  467027.000000  93587.000000

                 opt
count      44.000000
mean    60031.500000
std     71502.857607
min      2840.000000
25%      8100.500000
50%     23801.000000
75%     87597.500000
max    223539.000000

field_of_study - Summary Statistics:
            students
count    1037.000000
mean    18611.679846
std     34255.027828
min         1.000000
25%      1933.000000
50%      5795.000000
75%     21030.000000
max    215290.000000

origin - Summary Statistics:
            students
count   20411.000000
mean      904.447700
std      5865.759311
min         0.000000
25%         5.000000
50%        58.000000
75%       304.000000
max    165936.000000

source_of_fund - Summary Statistics:
            students
count     801.000000
mean    23692.245943
std     59244.460408
min         0.000000
25%       441.000000
50%      1770.000000
75%      8274.000000
max    364824.000000

academic_detail - Summary Statistics:
            students
count     216.000000
mean    87870.342593
std     86799.205915
min      7093.000000
25%     20776.500000
50%     58298.000000
75%    132951.750000
max    363927.000000

**Step 4 Missing Values:**

In [21]:
for table in tables:
    # Load table into DataFrame
    df = pd.read_sql_table(table, engine)
    # Check for missing values
    print(f"\n{table} - Missing Values:")
    print(df.isnull().sum())

# Close the engine connection
engine.dispose()

status - Missing Values:
year          0
female        0
male          0
single        0
married       0
full_time     0
part_time     0
visa_f        0
visa_j        0
visa_other    0
dtype: int64

academic - Missing Values:
year              0
students          0
us_students       3
undergraduate    26
graduate         26
non_degree       31
opt              31
dtype: int64

field_of_study - Missing Values:
year               0
field_of_study     0
major              0
students          38
dtype: int64

origin - Missing Values:
year             0
origin_region    0
origin           0
academic_type    0
students         0
dtype: int64

source_of_fund - Missing Values:
year              0
academic_type     0
source_type       0
source_of_fund    0
students          0
dtype: int64

academic_detail - Missing Values:
year              0
academic_type     0
academic_level    0
students          0
dtype: int64

**Step 5 Data Transformation**

In [22]:
# Calculate Female Percentage and update the DataFrame
statusDisplay['female_percentage'] = (statusDisplay['female'] / (statusDisplay['female'] + statusDisplay['male'])) * 100

# Assuming 'engine' is your SQLAlchemy engine
# Use the 'if_exists' parameter to replace the existing 'status_modified' table
statusDisplay.to_sql('status', engine, if_exists='replace', index=False)

# Now, retrieve and display the updated table
updated_status = pd.read_sql("SELECT * FROM status;", engine)
updated_status.head()

,year,female,male,single,married,full_time,part_time,visa_f,visa_j,visa_other,female_percentage
0,2007/08,278841.0,344964.0,543958.0,79847.0,575772.0,48033.0,552691.0,31814.0,39300.0,44.700026
1,2008/09,304242.0,367374.0,591694.0,79922.0,613185.0,58431.0,589007.0,39625.0,42984.0,45.299993
2,2009/10,309534.0,381389.0,615612.0,75311.0,637722.0,53201.0,612158.0,38692.0,40073.0,44.800072
3,2010/11,322582.0,400695.0,653842.0,69435.0,669031.0,54246.0,645163.0,40504.0,37610.0,44.600063
4,2011/12,338671.0,425824.0,690339.0,74156.0,714038.0,50457.0,688810.0,42047.0,33638.0,44.299963

In [23]:
print(originDisplay.columns)

Index(['year', 'origin_region', 'origin', 'academic_type', 'students'], dtype='object')

In [24]:
# Merge academicDetailDisplay with academicDisplay
merged_academic = pd.merge(academicDetailDisplay, academicDisplay, on='year', how='inner')
# Merge with studyFieldDisplay based on 'year' and 'field_of_study' columns
merged_academic = pd.merge(merged_academic, studyFieldDisplay, on=['year'], how='inner')
# Merge with originDisplay based on 'year' column
merged_academic = pd.merge(merged_academic, originDisplay, on=['year'], how='inner', suffixes=('_academic', '_origin'))
# Merge with sourceOfFundDisplay based on 'year' and 'academic_type' columns
merged_academic = pd.merge(merged_academic, sourceOfFundDisplay, on=['year'], how='inner', suffixes=('_academic', '_source_of_fund'))
# Merge with statusDisplay
merged_academic = pd.merge(merged_academic, statusDisplay, on='year', how='inner')
# Now, 'merged_academic' contains the result of all the inner joins
# Display a subset of the merged DataFrame
print(merged_academic.head())

:

**Step 6 Statistical Analysis**

In [ ]:
# Total Enrollment Over the Years:
total_enrollment = pd.read_sql_query(
    """
    SELECT year, SUM(female) AS total_female, SUM(male) AS total_male
    FROM status
    GROUP BY year
    ORDER BY year;
    """, engine)

In [ ]:
# Plot Total Enrollment Over the Years
plt.figure(figsize=(10, 6))
plt.plot(total_enrollment['year'], total_enrollment['total_female'], label='Female')
plt.plot(total_enrollment['year'], total_enrollment['total_male'], label='Male')
plt.title('Total Enrollment Over the Years')
plt.xlabel('Year')
plt.ylabel('Total Enrollment')
plt.legend()
plt.show()

In [ ]:
# Total Enrollment Over the Years:
total_enrollment = pd.read_sql_query(
    """
    SELECT
    year,
    ROUND(total_female / (total_female + total_male) * 100, 2) AS female_percentage
FROM
    (
        SELECT
            year,
            SUM(female) AS total_female,
            SUM(male) AS total_male
        FROM
            status
        GROUP BY
            year
        ORDER BY
            year
    ) AS total_enrollment;


    """, engine)
total_enrollment

In [ ]:
# Plot Total Enrollment Over the Years
plt.figure(figsize=(10, 6))
plt.plot(total_enrollment['year'], total_enrollment['female_percentage'], marker='o')
plt.title('Female Percentage of Total Enrollment Over the Years')
plt.xlabel('Year')
plt.ylabel('Female Percentage')
plt.show()

In [ ]:
# Average Female Percentage Over the Entire Period:
average_gender_percentage  = pd.read_sql_query(
    """
    SELECT
    AVG(total_female / (total_female + total_male) * 100) AS average_female_percentage,
    AVG(total_male / (total_female + total_male) * 100) AS average_male_percentage
FROM (
    SELECT
        SUM(female) AS total_female,
        SUM(male) AS total_male
    FROM status
) AS total_enrollment;

    """, engine)
average_gender_percentage

In [ ]:
# Plot Average Female and Male Percentages
plt.figure(figsize=(8, 5))
plt.bar(['Average Female Percentage', 'Average Male Percentage'],
        [average_gender_percentage['average_female_percentage'].iloc[0],
         average_gender_percentage['average_male_percentage'].iloc[0]], color = 'lightblue')
plt.title('Average Female and Male Percentages Over the Entire Period')
plt.ylabel('Percentage')
plt.show()

In [ ]:
# Yearly Change in Female Percentage:
yearly_change =  pd.read_sql_query(
    """
    SELECT
    year,
    ROUND(
        (LEAD(total_female / (total_female + total_male) * 100) OVER (ORDER BY year) -
         total_female / (total_female + total_male) * 100), 2) AS change_in_female_percentage
FROM (
    SELECT
        year,
        SUM(female) AS total_female,
        SUM(male) AS total_male
    FROM
        status
    GROUP BY
        year
    ORDER BY
        year
) AS total_enrollment;

    """, engine)
yearly_change

In [ ]:
# Plot Yearly Change in Female Percentage
plt.figure(figsize=(10, 6))
plt.plot(yearly_change['year'], yearly_change['change_in_female_percentage'], marker='o')
plt.title('Yearly Change in Female Percentage')
plt.xlabel('Year')
plt.ylabel('Change in Female Percentage')
plt.show()

In [ ]:
# Year with the Highest Female Percentage:
highest_female_percentage = pd.read_sql_query(
    """
    SELECT
    year,
    female_percentage
FROM (
    SELECT
        year,
        ROUND(SUM(female) / (SUM(female) + SUM(male)) * 100, 2) AS female_percentage
    FROM
        status
    GROUP BY
        year
    ORDER BY
        female_percentage DESC
    LIMIT 1
) AS year_with_highest_female_percentage;

    """, engine)
highest_female_percentage

**Step 7: Create a Data Pipeline for Tableau Integration**